# <u> * DataFrames * </u>
* Enhanced two-dimensional array.
* Can have custom row and column indices.
* Supports missing data.
* Each column in a DataFrame is a Series
    - Columns may contain different element types.

In [33]:
import pandas as pd

In [34]:
grades_dict = {'Wally': [87, 96, 70, 100, 81, 82, 83, 65, 85], 'Eva': [100, 87, 90, 83, 65, 85, 100, 81, 82],
               'Sam': [94, 77, 90, 87, 96, 70, 100, 81, 82], 'Katie': [100, 81, 82, 77, 90, 87, 96, 70, 100],
               'Bob': [83, 65, 85, 83, 65, 85, 33, 44, 11]}

In [35]:
grades = pd.DataFrame(grades_dict)

In [36]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85
3    100   83   87     77   83
4     81   65   96     90   65
5     82   85   70     87   85
6     83  100  100     96   33
7     65   81   81     70   44
8     85   82   82    100   11

### <u> * Creating a Custom Index for an existing DataFrame * </u>

In [37]:
grades.index = ['Math', 'Physics', 'Chemistry', 'Biology', 'English', 'Hindi', 'Sanskrit', 'ComputerScience', 'PE']

In [38]:
grades

                 Wally  Eva  Sam  Katie  Bob
Math                87  100   94    100   83
Physics             96   87   77     81   65
Chemistry           70   90   90     82   85
Biology            100   83   87     77   83
English             81   65   96     90   65
Hindi               82   85   70     87   85
Sanskrit            83  100  100     96   33
ComputerScience     65   81   81     70   44
PE                  85   82   82    100   11

### <u> * Accessing a DataFrame's Columns * </u>

In [39]:
grades.Eva

Math               100
Physics             87
Chemistry           90
Biology             83
English             65
Hindi               85
Sanskrit           100
ComputerScience     81
PE                  82
Name: Eva, dtype: int64

In [40]:
grades['Sam']

Math                94
Physics             77
Chemistry           90
Biology             87
English             96
Hindi               70
Sanskrit           100
ComputerScience     81
PE                  82
Name: Sam, dtype: int64

### <u> * Accessing a DataFrame's Row * </u>

In [41]:
grades.loc['Math']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Math, dtype: int64

In [42]:
grades.iloc[0]

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Math, dtype: int64

In [43]:
grades.iloc[0][0]

87

### *<u> Slicing DataFrames </u>*

In [47]:
grades.loc['Math': 'Sanskrit'] # Note that LOC will include the last index as well unlike other slicing methods where the last index is ignored

           Wally  Eva  Sam  Katie  Bob
Math          87  100   94    100   83
Physics       96   87   77     81   65
Chemistry     70   90   90     82   85
Biology      100   83   87     77   83
English       81   65   96     90   65
Hindi         82   85   70     87   85
Sanskrit      83  100  100     96   33

In [48]:
grades.iloc[0:7] # When we use the ILOC it behaves like other slicing methods.

           Wally  Eva  Sam  Katie  Bob
Math          87  100   94    100   83
Physics       96   87   77     81   65
Chemistry     70   90   90     82   85
Biology      100   83   87     77   83
English       81   65   96     90   65
Hindi         82   85   70     87   85
Sanskrit      83  100  100     96   33

In [49]:
grades.loc[['Math', 'English']]

         Wally  Eva  Sam  Katie  Bob
Math        87  100   94    100   83
English     81   65   96     90   65

In [50]:
grades.iloc[[0, 4]]

         Wally  Eva  Sam  Katie  Bob
Math        87  100   94    100   83
English     81   65   96     90   65